In [3]:
import pandas as pd
import numpy as np

# This is what real data often looks like!
messy_employees = {
    'emp_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'name': ['John', 'Sarah', 'Mike', 'Lisa', 'Tom', 'Emma', 'Alex', 'Rachel', 'John', None],
    'department': ['IT', 'HR', 'IT', 'Finance', 'Marketing', 'IT', 'HR', 'Finance', 'IT', 'Sales'],
    'salary': ['75000', '65000', '80000', None, '60000', '85000', '70000', '95000', '75000', '50000'],
    'experience_yrs': [3, 2, 5, 8, 1, 6, 2, 10, 3, None],
    'join_date': ['2020-01-15', '2021-03-20', '2018-11-10', None, '2022-08-15', 
                  '2017-09-05', '2021-07-30', '2013-12-10', '2020-01-15', '2023-01-01'],
    'performance_score': [85, 92, 78, 88, None, 95, 90, 87, 85, 82]
}

df = pd.DataFrame(messy_employees)
print("=== MESSY EMPLOYEE DATA ===")
df

=== MESSY EMPLOYEE DATA ===

,emp_id,name,department,salary,experience_yrs,join_date,performance_score
0,101,John,IT,75000,3.0,2020-01-15,85.0
1,102,Sarah,HR,65000,2.0,2021-03-20,92.0
2,103,Mike,IT,80000,5.0,2018-11-10,78.0
3,104,Lisa,Finance,None,8.0,None,88.0
4,105,Tom,Marketing,60000,1.0,2022-08-15,NaN
5,106,Emma,IT,85000,6.0,2017-09-05,95.0
6,107,Alex,HR,70000,2.0,2021-07-30,90.0
7,108,Rachel,Finance,95000,10.0,2013-12-10,87.0
8,109,John,IT,75000,3.0,2020-01-15,85.0
9,110,None,Sales,50000,NaN,2023-01-01,82.0

In [ ]:
#ðŸ”¥ LEVEL 2 PRACTICE QUESTIONS
Set 1: Missing Value Management
Q1: How many missing values are in each column?
Q2: Fill missing salaries with the average salary of other employees
Q3: Remove any rows where both 'name' AND 'department' are missing
Q4: Fill missing performance scores with the median value

Set 2: Data Quality & Consistency
Q5: Find and remove duplicate employee records
Q6: Convert 'salary' column from string to integer data type
Q7: Convert 'join_date' to proper datetime format
Q8: Create a clean version where all missing values are handled appropriately

Set 3: Advanced Challenges
Q9: Which department has the most missing data?
Q10: Create a new column 'is_senior' (True if experience > 5 years, False otherwise)

In [14]:
missing_employees = df.isnull().sum()
print(missing_employees)

emp_id               0
name                 1
department           0
salary               1
experience_yrs       1
join_date            1
performance_score    1
dtype: int64

In [5]:
df['salary'] = df['salary'].astype(float)

average_salary = df['salary'].mean()
print(f"Average salary to use: ${average_salary:,.2f}")

missing_salaries = df.fillna({"salary": average_salary})
print(missing_salaries)

Average salary to use: $72,777.78
   emp_id    name department        salary  experience_yrs   join_date  \
0     101    John         IT  75000.000000             3.0  2020-01-15
1     102   Sarah         HR  65000.000000             2.0  2021-03-20
2     103    Mike         IT  80000.000000             5.0  2018-11-10
3     104    Lisa    Finance  72777.777778             8.0        None
4     105     Tom  Marketing  60000.000000             1.0  2022-08-15
5     106    Emma         IT  85000.000000             6.0  2017-09-05
6     107    Alex         HR  70000.000000             2.0  2021-07-30
7     108  Rachel    Finance  95000.000000            10.0  2013-12-10
8     109    John         IT  75000.000000             3.0  2020-01-15
9     110    None      Sales  50000.000000             NaN  2023-01-01

   performance_score
0               85.0
1               92.0
2               78.0
3               88.0
4                NaN
5               95.0
6               90.0
7               87.0
8               85.0
9               82.0

In [28]:
print("Before your operation:")
print(f"DataFrame shape: {df.shape}")
print(f"Missing names: {df['name'].isnull().sum()}")
print(f"Missing departments: {df['department'].isnull().sum()}")

row_remove = df.dropna()
print(f"\nAfter your dropna(): {row_remove.shape}")

# Check if any rows have both name AND department missing
both_missing = df[df['name'].isnull() & df['department'].isnull()]
print(f"Rows with both name AND department missing: {len(both_missing)}")

Before your operation:
DataFrame shape: (10, 7)
Missing names: 1
Missing departments: 0

After your dropna(): (7, 7)
Rows with both name AND department missing: 0

In [4]:
df['performance_score'] = df['performance_score'].astype(float)

median_value = df['performance_score'].median()
missing_perf = df.fillna({'performance_score': median_value})
print(missing_perf)

   emp_id    name department salary  experience_yrs   join_date  \
0     101    John         IT  75000             3.0  2020-01-15
1     102   Sarah         HR  65000             2.0  2021-03-20
2     103    Mike         IT  80000             5.0  2018-11-10
3     104    Lisa    Finance   None             8.0        None
4     105     Tom  Marketing  60000             1.0  2022-08-15
5     106    Emma         IT  85000             6.0  2017-09-05
6     107    Alex         HR  70000             2.0  2021-07-30
7     108  Rachel    Finance  95000            10.0  2013-12-10
8     109    John         IT  75000             3.0  2020-01-15
9     110    None      Sales  50000             NaN  2023-01-01

   performance_score
0               85.0
1               92.0
2               78.0
3               88.0
4               87.0
5               95.0
6               90.0
7               87.0
8               85.0
9               82.0

In [27]:
print("=== Q5: DUPLICATE DETECTION ===")

# Find all duplicate rows
duplicates = df.duplicated()
print(f"Total duplicate rows: {duplicates.sum()}")

# Show the actual duplicate rows
print("\nDuplicate rows:")
print(df[duplicates])

# Find duplicates based on specific columns (like employee ID or name)
duplicate_names = df.duplicated(subset=['name', 'salary'], keep=False)
print(f"\nEmployees with same name AND salary: {duplicate_names.sum()}")
print(df[duplicate_names])

=== Q5: DUPLICATE DETECTION ===
Total duplicate rows: 0

Duplicate rows:
Empty DataFrame
Columns: [emp_id, name, department, salary, experience_yrs, join_date, performance_score]
Index: []

Employees with same name AND salary: 2
   emp_id  name department   salary  experience_yrs   join_date  \
0     101  John         IT  75000.0             3.0  2020-01-15
8     109  John         IT  75000.0             3.0  2020-01-15

   performance_score
0               85.0
8               85.0

In [30]:
# Convert to integer
df['salary'] = df['salary'].fillna(0).astype(int)

# Check current data type
print(df['salary'].dtype)

int64

In [33]:
#Q7: Convert 'join_date' to proper datetime format

print(f"Before - join_date dtype: {df['join_date'].dtype}")
print(f"Sample dates: {df['join_date'].head(3).tolist()}")

# Convert to proper datetime
df['join_date'] = pd.to_datetime(df['join_date'])
print("\nAfter conversion:")
print(df.dtypes)

Before - join_date dtype: object
Sample dates: ['2020-01-15', '2021-03-20', '2018-11-10']

After conversion:
emp_id                        int64
name                         object
department                   object
salary                        int64
experience_yrs              float64
join_date            datetime64[ns]
performance_score           float64
dtype: object

In [34]:
#Q8: Create a clean version where all missing values are handled appropriately

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   emp_id             10 non-null     int64
 1   name               9 non-null      object
 2   department         10 non-null     object
 3   salary             10 non-null     int64
 4   experience_yrs     9 non-null      float64
 5   join_date          9 non-null      datetime64[ns]
 6   performance_score  9 non-null      float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(2)
memory usage: 692.0+ bytes

In [40]:
print("=== MY IMPROVED Q8 SOLUTION ===")

# Create clean copy
df_clean = df.copy()

# Step 1: Handle missing names
df_clean['name'] = df_clean['name'].fillna('Unknown')

# Step 2: Handle missing experience years  
exp_median = df_clean['experience_yrs'].median()  # Your turn!
df_clean['experience_yrs'] = df_clean['experience_yrs'].fillna(exp_median)  # Your turn!

# Step 3: Handle missing join dates
df_clean['join_date'] = df_clean['join_date'].fillna('2020-01-01')  # Your turn!

# Step 4: Remove duplicates
df_clean = df_clean.drop_duplicates()  # Your turn!

# Final check
print(f"Missing values remaining: {df_clean.isnull().sum().sum()}")
print("CLEAN DATASET READY! ðŸŽ‰")

=== MY IMPROVED Q8 SOLUTION ===
Missing values remaining: 1
CLEAN DATASET READY! ðŸŽ‰